cache/posts/recall-precision-fscore.html
<p>
这个三个数据用于描述一个模型的好坏程度，分别为召回率、准确度和F值。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">定义</h2>
<div class="outline-text-2" id="text-1">
<p>
在二分类模型中，对于任意一个输入数据，结果只用两个：正类或者负类。对于一个输入数据集，假定该模型产生如下结果：
</p>

<ul class="org-ul">
<li>PT： 模型结果为正类且真实为正类的数目
</li>
<li>PF： 模型结果为正类且真实为负类的数目
</li>
<li>NT： 模型结果为负类且真实为负类的数目
</li>
<li>NF： 模型结果为负类且真实为正类的数目
</li>
</ul>


<p>
则召回率、准确度和F值的定义分别为：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Recall</td>
<td class="left">\(\frac{PT}{PT + NF}\)</td>
</tr>

<tr>
<td class="left">Precision</td>
<td class="left">\(\frac{PT}{PT + PF}\)</td>
</tr>

<tr>
<td class="left">F-score</td>
<td class="left">\(\frac{Recall + Precision}{2}\)</td>
</tr>
</tbody>
</table>

<p>
召回率和准确度具有相同的分子，分母不同。F值是二者的算数平均数。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">搜索引擎的例子</h2>
<div class="outline-text-2" id="text-2">
<p>
假设给定一个关键字， 搜索引擎返回了100个文档，其中80个是正确的，也即符合关键字，
剩余20个是错误的，也即和给定的关键字没有关系。则此时准确度为： \(80/100 = 80\%\)
</p>

<p>
假设还有40篇文档也符合这个关键字，但搜索引擎并没有返回这40篇文档，则召回率为： \(80 / (80 + 40) = 67\%\)
</p>

<p>
由此可见， 召回率表示了搜索引擎从所有符合条件的文档中“召回”正确文档的比例， 而准确度表示了搜索引擎返回文档中正确文档的比例。
所有符合条件的文档和返回文档这两个概念是不同的。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">进一步思考</h2>
<div class="outline-text-2" id="text-3">
<p>
召回率描述了是否有遗漏，准确度描述了是否正确，F值综合了二者。
</p>

<p>
  如果一个模型如果准确率很高，但召回率很低，即使结果中大多数数据是正确的，但却遗漏了很多正确的数据。如果一个模型召回率很高，
但准确率很低，则表示这个模型可能返回所有正确的数据，但返回的数据中，错误的数据也很多。
</p>

<p>
好的模型应该做到召回率和准确率都较高，也即F值较高。
</p>
</div>
</div>
